#!/bin/bash
#set -eux
#===================================================================================================
#
# Production Build for docs
#
#===================================================================================================
#---------------------------------------------------------------------------------------------------
# 設定
#---------------------------------------------------------------------------------------------------
dir_script="$(dirname $0)"
cd "$(cd ${dir_script}; cd ..; pwd)" || exit 6

DIR_BASE="$(pwd)"
DIR_SRC="${DIR_BASE}/docs/adoc"
DIR_DIST="${DIR_BASE}/docs"


#---------------------------------------------------------------------------------------------------
# acsiidoctor
#---------------------------------------------------------------------------------------------------
echo "acsiidoctor"
asciidoctor                                                                                        \
  --safe-mode unsafe                                                                               \
  -a lang=ja                                                                                       \
  -b html5                                                                                         \
  -d book                                                                                          \
  --destination-dir ${DIR_DIST}                                                                    \
  ${DIR_SRC}/index.adoc
retcode=$?
if [[ ${retcode} -ne 0 ]] || [[ ! -f ${DIR_DIST}/index.html ]]; then
  echo "acsiidoctorでエラーが発生しました。" >&2
  exit 6
fi


#---------------------------------------------------------------------------------------------------
# 相対パスの置換
#---------------------------------------------------------------------------------------------------
echo ""
echo "相対パスの置換"
path_dist=${DIR_DIST}/index.html
mv ${path_dist} ${path_dist}.org

cat ${path_dist}.org                                                                               |
sed -e 's|../images/|images/|g'                                                                    |
tee > ${path_dist}

rm -f ${path_dist}.org

echo ""
echo "ビルドが完了しました。"
exit 0
